--  Total_Charges כתיבת הקוד הבא עקב טיפוס לא נכון בטבלה של
-- פייתון ראתה שדות ריקים וקבע שהם שדות טקסט 
--  אנחנו חייבים לסדר זאת ולהפוך ערכים בולאנים אלו למספריים
-- רק כך נוכל לבצע עליהם חישובים
-- view הוא אינו טבלה אמיתית אלא שומרת את ההיגיון שאני כותבת תחת שם מסויים

-- יצירה של טבלה חדשה ויקטואלית היא לא באמת נשמרת או מחליפה את הטבלה שלי 
ALTER VIEW v_clean_data AS 
-- שליפה של עמודות מסויימות מהטבלה
SELECT customerID, MonthlyCharges, tenure, Contract, InternetService, 
-- בדיקה אם הערך הוא כן
CASE WHEN Churn = 'Yes'
-- נהפוך אותו ל-1
	THEN 1
	-- אחרת נהפוך אותו ל-0
	ELSE 0
	-- סוגר את התנאי 
	-- עכשיו אנחנו נותנים שם חדש לעמודה שפתחנו
	-- 	היא מכילה את הערכים המספריים במקום הבוליאנים
	END churn_label,

	-- ותהפוך אותה לערך מספרי עשרוני TotalCharges קח את העמודה
	--  TRY_CAST_CLAEN לתוצאה החדשה תקרא
	TRY_CAST (TotalCharges AS FLOAT) AS total_charges_clean 



-- שהמחשב ידע עם איזה דאטה בייס לעבוד
FROM dbo.raw_data_staging;